nidefawl/esp32-rgb/main/esp32-rgb-main.c
#include "esp_err.h"
#include "esp_event.h"
#include "esp_log.h"
#include "esp_netif.h"
#include "esp_system.h"
#include "esp_timer.h"
#include "esp_wifi.h"
#include "esp_wifi_types_generic.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "led_strip.h"
#include "led_strip_spi.h"
#include "led_strip_types.h"
#include "nvs_flash.h"
#include "nvs.h"
#include "portmacro.h"
#include <math.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <sys/param.h>
#include <esp_http_server.h>

#include "lwip/err.h"
#include "lwip/sockets.h"
#include "lwip/sys.h"
#include "rgb-network-types.h"
#include <lwip/netdb.h>
#include "driver/ledc.h"
#include "nvs_wifi_connect.h"
#include "mdns.h"
#include "lwip/apps/netbiosns.h"

#define CONFIG_USE_IPV4 1
#define CONFIG_USE_IPV6 1
#define CONFIG_MAX_LEDS 30

#define CONFIG_USE_ASYNC_RMT 1
#ifdef CONFIG_IDF_TARGET_ESP32S3
#define MAX_RMT_CHANNELS 4
#else
#define MAX_RMT_CHANNELS 8
#endif

#define LED_UDP_LISTEN_PORT 54321
#define DISPLAY_CONFIG_VERSION 2
#define DISPLAY_NETWORK_HOSTNAME_DEFAULT "esp32-rgb"
#define DISPLAY_NETWORK_WIFI_AP_SSID_DEFAULT "ESP32-RGB"
#define DISPLAY_NETWORK_WIFI_AP_PASS_DEFAULT "rgb1234"
#define STORAGE_NAMESPACE "esp32-rgb"
static const char* TAG = "RGB_MAIN";

enum DebugFlags : uint8_t {
  DebugNone = 0,
};

struct DisplayState {
  bool bHeartbeatEnabled;
  bool bRuntimeStatsEnabled;
  // ring buffer positions
  volatile uint64_t readIndex;
  volatile uint64_t writeIndex;
  // runtime stats
  int64_t numCallbacks;
  int64_t numFrames;
  int64_t numBufferUnderrun;
  int64_t numLastCallbacks;
  int64_t numLastFrames;
  int64_t numHeartbeats;
  float fps_actual;
  float fps_callbacks;
};

enum : uint16_t {
  RingBufferLength = 64,
};

static led_strip_handle_t led_strips[CONFIG_MAX_STRIPS] = {};
static struct DisplayState displayState;
static display_config_t displayConfig;
static display_led_strip_config_t displayLedStripConfig[CONFIG_MAX_STRIPS];
static display_network_config_t displayNetworkConfig;
static bool bDisplayConfigChanged = false;
static volatile uint32_t ledsBuffer[RingBufferLength][CONFIG_MAX_STRIPS][CONFIG_MAX_LEDS];
static esp_timer_handle_t periodic_timer;
static SemaphoreHandle_t semaphoreDisplay = NULL;
static StaticSemaphore_t s_semaphoreDisplay;
static SemaphoreHandle_t semaphoreNetwork = NULL;
static SemaphoreHandle_t semaphoreNetworkMasterAddress = NULL;
static SemaphoreHandle_t semaphoreSocketStart = NULL;
struct sockaddr_storage g_udp_master_address = {};
static int64_t g_timeLastFrame_us = 0;
static uint8_t udp_rx_buffer[4096];
static int s_socket = -1;

static void display_state_reset() {
  memset((void*)ledsBuffer, 0, sizeof(ledsBuffer));
  memset(&displayState, 0, sizeof(displayState));
  displayState.readIndex  = 0;
  displayState.writeIndex = 0;
}

static void display_buffer_position_reset() {
  displayState.readIndex  = 0;
  displayState.writeIndex = 0;
  displayState.numFrames = 0;
  displayState.numCallbacks = 0;
  displayState.numBufferUnderrun = 0;
  displayState.numLastFrames = 0;
  displayState.numLastCallbacks = 0;
  displayState.numHeartbeats = 0;
}

static bool display_config_validate(display_config_t* config) {
  if (config->version < DISPLAY_CONFIG_VERSION) {
    ESP_LOGE(TAG, "Invalid version");
    return false;
  }
  if (config->magic != DISPLAY_CONFIG_MAGIC) {
    ESP_LOGE(TAG, "Invalid magic");
    return false;
  }
  if (config->dimensionsWidth < 1 || config->dimensionsHeight < 1
      || config->dimensionsWidth > CONFIG_MAX_STRIPS || config->dimensionsHeight > CONFIG_MAX_LEDS) {
    ESP_LOGE(TAG, "Invalid display dimensions");
    return false;
  }
  if (config->frameRate < 1) {
    ESP_LOGE(TAG, "Invalid frame rate");
    return false;
  }
  return true;
}

static bool display_strip_config_validate(display_led_strip_config_all_t* config) {
  if (config->version < DISPLAY_CONFIG_VERSION) {
    ESP_LOGE(TAG, "Invalid version");
    return false;
  }
  if (config->magic != DISPLAY_CONFIG_MAGIC) {
    ESP_LOGE(TAG, "Invalid magic");
    return false;
  }
  for (int i = 0; i < CONFIG_MAX_STRIPS; i++) {
    if (config->configs[i].gpio < -1) {
      ESP_LOGE(TAG, "Invalid GPIO for strip %d", i);
      return false;
    }
    if (config->configs[i].ledType > LED_TYPE_SK6812) {
      ESP_LOGE(TAG, "Invalid LED type for strip %d", i);
      return false;
    }
    if (config->configs[i].dataTypeId > RGB_DATA_TYPE_RGBW) {
      ESP_LOGE(TAG, "Invalid data type for strip %d", i);
      return false;
    }
    if (config->configs[i].ledCount < 1) {
      ESP_LOGE(TAG, "Invalid LED count for strip %d", i);
      return false;
    }
  }
  return true;
}

static bool display_network_config_validate(display_network_config_t* config) {
  if (config->version < DISPLAY_CONFIG_VERSION) {
    ESP_LOGE(TAG, "Invalid version");
    return false;
  }
  if (config->magic != DISPLAY_CONFIG_MAGIC) {
    ESP_LOGE(TAG, "Invalid magic");
    return false;
  }
  // check for empty hostname
  if (strnlen(config->hostname, sizeof(config->hostname)) < 1) {
    ESP_LOGE(TAG, "Invalid hostname");
    return false;
  }
  if (config->wifiMode >= NUM_NETWORK_WIFI_MODES) {
    ESP_LOGE(TAG, "Invalid wifi mode");
    return false;
  }
  enum WifiMode wifiMode = (enum WifiMode)config->wifiMode;
  // check for empty SSID
  if (wifiMode == NETWORK_WIFI_MODE_AP && strnlen(config->apWifiSsid, sizeof(config->apWifiSsid)) < 1) {
    ESP_LOGE(TAG, "Invalid AP SSID");
    return false;
  }
  if (wifiMode == NETWORK_WIFI_MODE_STA && strnlen(config->staWifiSsid, sizeof(config->staWifiSsid)) < 1) {
    ESP_LOGE(TAG, "Invalid STA SSID");
    return false;
  }
  return true;
}

static void display_config_reset(display_config_t* config) {
  config->version = DISPLAY_CONFIG_VERSION;
  config->magic = DISPLAY_CONFIG_MAGIC;
  config->rmtClockResolution_hz = 10000000; // 10MHz
  config->dimensionsWidth = 1;
  config->dimensionsHeight = 15;
  config->maxBrightness = 127;
  config->frameRate = 60;
  config->stripsEnable = 0xFFFF;
  config->debugFlags = DebugNone;
  config->heartbeatIntervalFrames = 8;
}

static void display_strip_config_reset(display_led_strip_config_all_t* config) {
  config->version = DISPLAY_CONFIG_VERSION;
  config->magic = DISPLAY_CONFIG_MAGIC;
  memset(&config->configs, 0, sizeof(display_led_strip_config_t) * CONFIG_MAX_STRIPS);
  for (int i = 0; i < CONFIG_MAX_STRIPS; i++) {
    config->configs[i].gpio = -1;
    config->configs[i].ledCount = 1;
    config->configs[i].ledType = LED_TYPE_WS2812B;
    config->configs[i].dataTypeId = RGB_DATA_TYPE_RGB;
  }
}

static void display_network_config_reset(display_network_config_t* config) {
  config->version = DISPLAY_CONFIG_VERSION;
  config->magic = DISPLAY_CONFIG_MAGIC;
  config->port = 54321;
  config->wifiMode = NETWORK_WIFI_MODE_AP;
  memset(&config->hostname, 0, sizeof(config->hostname));
  memset(&config->apWifiSsid, 0, sizeof(config->apWifiSsid));
  memset(&config->apWifiPassword, 0, sizeof(config->apWifiPassword));
  memset(&config->staWifiSsid, 0, sizeof(config->staWifiSsid));
  memset(&config->staWifiPassword, 0, sizeof(config->staWifiPassword));
  strncpy(config->hostname, DISPLAY_NETWORK_HOSTNAME_DEFAULT, sizeof(config->hostname));
  strncpy(config->apWifiSsid, DISPLAY_NETWORK_WIFI_AP_SSID_DEFAULT, sizeof(config->apWifiSsid));
  strncpy(config->apWifiPassword, DISPLAY_NETWORK_WIFI_AP_PASS_DEFAULT, sizeof(config->apWifiPassword));
}

static void log_display_config(display_config_t* config) {
  ESP_LOGI(TAG, "Version: %lu", config->version);
  ESP_LOGI(TAG, "Magic: %lu", config->magic);
  ESP_LOGI(TAG, "ClockResolution: %lu -> %lu", displayConfig.rmtClockResolution_hz, config->rmtClockResolution_hz);
  ESP_LOGI(TAG, "Width: %lu -> %lu", displayConfig.dimensionsWidth, config->dimensionsWidth);
  ESP_LOGI(TAG, "Height: %lu -> %lu", displayConfig.dimensionsHeight, config->dimensionsHeight);
  ESP_LOGI(TAG, "FrameRate: %u -> %u", displayConfig.frameRate, config->frameRate);
  ESP_LOGI(TAG, "Heartbeat: %lu -> %lu", displayConfig.heartbeatIntervalFrames, config->heartbeatIntervalFrames);
  ESP_LOGI(TAG, "Brightness: %u -> %u", displayConfig.maxBrightness, config->maxBrightness);
  ESP_LOGI(TAG, "Strips: %lu -> %lu", displayConfig.stripsEnable, config->stripsEnable);
  ESP_LOGI(TAG, "Debug: %lu -> %lu", displayConfig.debugFlags, config->debugFlags);
}

