nidefawl/esp32-rgb/main/esp32-rgb-main.c
static void log_display_strip_config(display_led_strip_config_all_t* config) {
  ESP_LOGI(TAG, "Version: %lu", config->version);
  ESP_LOGI(TAG, "Magic: %lu", config->magic);
  for (int i = 0; i < CONFIG_MAX_STRIPS; i++) {
    ESP_LOGI(TAG, "Strip %d: GPIO %d, LED count %d, LED type %d, Data type %d", i, config->configs[i].gpio, config->configs[i].ledCount, config->configs[i].ledType, config->configs[i].dataTypeId);
  }
}

static void display_strips_init();
static void display_config_set(display_config_t* config, bool bForceReset) {
  bool bChanged = memcmp(&displayConfig, config, sizeof(display_config_t)) != 0;
  log_display_config(config);
  if (bChanged || bForceReset) {
    if (periodic_timer) {
      esp_timer_stop(periodic_timer);
    }
    vTaskDelay(5);
    xSemaphoreTake(semaphoreDisplay, portMAX_DELAY);
    displayConfig = *config;
    display_strips_init();
    display_buffer_position_reset();
    xSemaphoreGive(semaphoreDisplay);
    if (periodic_timer) {
      ESP_ERROR_CHECK(esp_timer_start_periodic(periodic_timer, 1000000 / config->frameRate));
    }
    bDisplayConfigChanged = true;
  }
}
static void display_strip_config_set(display_led_strip_config_all_t* config, bool bForceReset) {
  bool bChanged = memcmp(&displayLedStripConfig[0], &config->configs[0], sizeof(display_led_strip_config_t) * CONFIG_MAX_STRIPS) != 0;
  log_display_strip_config(config);
  if (bChanged || bForceReset) {
    if (periodic_timer) {
      esp_timer_stop(periodic_timer);
    }
    vTaskDelay(5);
    for (int i = 0; i < CONFIG_MAX_STRIPS; i++) {
      displayLedStripConfig[i] = config->configs[i];
    }
    display_strips_init();
    display_buffer_position_reset();
    if (periodic_timer) {
      ESP_ERROR_CHECK(esp_timer_start_periodic(periodic_timer, 1000000 / displayConfig.frameRate));
    }
    bDisplayConfigChanged = true;
  }
}


static esp_err_t write_nvs_struct(const char* key, void* data, size_t len) {
    nvs_handle_t my_handle;
    esp_err_t err;

    // Open
    err = nvs_open(STORAGE_NAMESPACE, NVS_READWRITE, &my_handle);
    if (err != ESP_OK) return err;

    // Write data
    err = nvs_set_blob(my_handle, key, data, len);
    if (err != ESP_OK) return err;

    // Commit
    err = nvs_commit(my_handle);
    if (err != ESP_OK) return err;

    // Close
    nvs_close(my_handle);
    return err;
}
static esp_err_t read_nvs_struct(const char* key, void* data, size_t len) {
    nvs_handle_t nvs_handle;
    esp_err_t err;

    // Open
    err = nvs_open(STORAGE_NAMESPACE, NVS_READONLY, &nvs_handle);
    if (err != ESP_OK)  {
      return err;
    }

    // Read the size of memory space required for data
    size_t stored_data_len = 0;
    err = nvs_get_blob(nvs_handle, key, NULL, &stored_data_len);
    if (err != ESP_OK && err != ESP_ERR_NVS_NOT_FOUND)
      return err;
    if (stored_data_len >= len) {
      // Read previously saved display_config_t if available
      uint32_t* read_buf = malloc(stored_data_len);
      err = nvs_get_blob(nvs_handle, key, read_buf, &stored_data_len);
      if (err == ESP_OK) {
        memcpy(data, read_buf, len);
      }
      free(read_buf);
    }
    nvs_close(nvs_handle);
    return err;
}

void write_strip_config(display_led_strip_config_all_t* config) {
  if (display_strip_config_validate(config)) {
    xSemaphoreTake(semaphoreDisplay, portMAX_DELAY);
    display_strip_config_set(config, true);
    write_nvs_struct("strip_config", config, sizeof(display_led_strip_config_all_t));
    xSemaphoreGive(semaphoreDisplay);
    ESP_LOGI(TAG, "Set LED strip config all");
  } else {
    ESP_LOGE(TAG, "Invalid LED strip config all");
  }
}

static void _log_nvs_error(esp_err_t err){
  switch (err) {
    case ESP_OK:
      break;
    case ESP_FAIL:
      ESP_LOGE(TAG, "Error: Failed. NVS corrupt?");
      break;
    case ESP_ERR_NVS_NOT_INITIALIZED:
      ESP_LOGE(TAG, "Error: NVS not initialized");
      break;
    case ESP_ERR_NVS_NOT_FOUND:
      ESP_LOGE(TAG, "Error: NVS not found");
      break;
    case ESP_ERR_NVS_TYPE_MISMATCH:
      ESP_LOGE(TAG, "Error: NVS type mismatch");
      break;
    case ESP_ERR_NVS_READ_ONLY:
      ESP_LOGE(TAG, "Error: NVS read only");
      break;
    case ESP_ERR_NVS_NOT_ENOUGH_SPACE:
      ESP_LOGE(TAG, "Error: NVS not enough space");
      break;
    case ESP_ERR_NVS_INVALID_NAME:
      ESP_LOGE(TAG, "Error: NVS invalid name");
      break;
    case ESP_ERR_NVS_INVALID_HANDLE:
      ESP_LOGE(TAG, "Error: NVS invalid handle");
      break;
    case ESP_ERR_NVS_REMOVE_FAILED:
      ESP_LOGE(TAG, "Error: NVS remove failed");
      break;
    case ESP_ERR_NVS_KEY_TOO_LONG:
      ESP_LOGE(TAG, "Error: NVS key too long");
      break;
    case ESP_ERR_NVS_PAGE_FULL:
      ESP_LOGE(TAG, "Error: NVS page full");
      break;
    case ESP_ERR_NVS_INVALID_STATE:
      ESP_LOGE(TAG, "Error: NVS invalid state");
      break;
    case ESP_ERR_NVS_INVALID_LENGTH:
      ESP_LOGE(TAG, "Error: NVS invalid length");
      break;
    case ESP_ERR_NVS_NO_FREE_PAGES:
      ESP_LOGE(TAG, "Error: NVS no free pages");
      break;
    case ESP_ERR_NVS_VALUE_TOO_LONG:
      ESP_LOGE(TAG, "Error: NVS value too long");
      break;
    case ESP_ERR_NVS_PART_NOT_FOUND:
      ESP_LOGE(TAG, "Error: NVS part not found");
      break;
    default:
      // unknown error, print as hex
      ESP_LOGE(TAG, "Error: 0x%x", err);
      break;
  }
}
static void display_load_config_from_flash() {
  xSemaphoreTake(semaphoreDisplay, portMAX_DELAY);
  esp_err_t err;
  display_config_t config;
  if ((err = read_nvs_struct("display_config", &config, sizeof(display_config_t))) != ESP_OK 
      || !display_config_validate(&config)) {
    display_config_reset(&config);
    ESP_LOGW(TAG, "Invalid config in flash, resetting");
    esp_err_t err = write_nvs_struct("display_config", &config, sizeof(display_config_t));
    if (err != ESP_OK) {
      ESP_LOGE(TAG, "Error writing config to flash");
      _log_nvs_error(err);
    }
  } else {
    ESP_LOGI(TAG, "Loaded config from flash");
    log_display_config(&config);
  }
  display_network_config_t networkConfig;
  if ((err = read_nvs_struct("network_config", &networkConfig, sizeof(display_network_config_t))) != ESP_OK
      || !display_network_config_validate(&networkConfig)) {
    ESP_LOGW(TAG, "Invalid network config in flash, resetting");
    display_network_config_reset(&networkConfig);
    esp_err_t err = write_nvs_struct("network_config", &networkConfig, sizeof(display_network_config_t));
    if (err != ESP_OK) {
      ESP_LOGE(TAG, "Error writing network config to flash");
      _log_nvs_error(err);
    }
  } else {
    ESP_LOGI(TAG, "Loaded network config from flash");
  }
  displayConfig = config;
  displayNetworkConfig = networkConfig;
  display_led_strip_config_all_t ledStripConfigAll;
  if ((err = read_nvs_struct("strip_config", &ledStripConfigAll, sizeof(display_led_strip_config_all_t))) != ESP_OK 
    || !display_strip_config_validate(&ledStripConfigAll)) {
    display_strip_config_reset(&ledStripConfigAll);
    ESP_LOGW(TAG, "Invalid LED strip config in flash, resetting");
    write_strip_config(&ledStripConfigAll);
  } else {
    display_strip_config_set(&ledStripConfigAll, false);
    ESP_LOGI(TAG, "Loaded LED strip config from flash");
  }
  bDisplayConfigChanged = false;
  xSemaphoreGive(semaphoreDisplay);
}

static uint8_t scale_and_clamp(uint8_t color, uint8_t maxBrightness) {
  uint32_t scaled = color;
  scaled *= maxBrightness;
  scaled /= 255;
  if (scaled > 255)
    return 255;
  return scaled;
}


static void scale_and_clamp_u32(uint32_t color, uint8_t maxBrightness, uint8_t* out) {
  uint8_t w = (color >> 24) & 0xFF;
  uint8_t r = (color >> 16) & 0xFF;
  uint8_t g = (color >> 8) & 0xFF;
  uint8_t b = color & 0xFF;
  out[0]    = scale_and_clamp(r, maxBrightness);
  out[1]    = scale_and_clamp(g, maxBrightness);
  out[2]    = scale_and_clamp(b, maxBrightness);
  out[3]    = scale_and_clamp(w, maxBrightness);
}

