nidefawl/esp32-rgb/main/esp32-rgb-main.c
static uint32_t clamp_u32(uint32_t i, uint32_t i_min, uint32_t i_max) {
  return i < i_min ? i_min : (i > i_max ? i_max : i);
}

static led_strip_handle_t display_led_strip_configure(uint32_t stripIndex, display_led_strip_config_t* stripConfig) {
  display_config_t* config = &displayConfig;
  if (stripIndex >= config->dimensionsWidth) {
    ESP_LOGE(TAG, "Invalid strip index");
    return NULL;
  }

  // LED strip general initialization
  led_strip_config_t strip_config = {
    .strip_gpio_num = stripConfig->gpio,        // The GPIO that connected to the LED strip's data line
    .max_leds       = config->dimensionsHeight, // Number of LEDs in your strip
    .led_pixel_format = stripConfig->dataTypeId == RGB_DATA_TYPE_RGB ? LED_PIXEL_FORMAT_GRB : LED_PIXEL_FORMAT_GRBW, // Pixel format of the strip
    .led_model        = stripConfig->ledType == LED_TYPE_WS2812B ? LED_MODEL_WS2812 : LED_MODEL_SK6812, // LED model of the strip
    .flags.invert_out = false,// whether to invert the output signal
  };


  led_strip_handle_t led_strip;
  if (stripIndex < MAX_RMT_CHANNELS) {
    // LED strip backend configuration: RMT
    led_strip_rmt_config_t rmt_config = {
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 0, 0)
      .rmt_channel = 0,
#else
      .clk_src       = RMT_CLK_SRC_DEFAULT, // different clock source can lead to different power consumption
      .resolution_hz = config->rmtClockResolution_hz,// RMT counter clock frequency
      .flags.with_dma =
      false,// DMA feature is available on ESP target like ESP32-S3
#endif
    };
    ESP_ERROR_CHECK(led_strip_new_rmt_device(&strip_config, &rmt_config, &led_strip));
    ESP_LOGI(TAG, "Created LED strip object with RMT backend (GPIO %d) (PixelFormat %s)", stripConfig->gpio,
             stripConfig->dataTypeId ? "RGBW" : "RGB");
  } else if (stripIndex < CONFIG_MAX_STRIPS) {
    // LED strip backend configuration: SPI
    led_strip_spi_config_t spi_config = {
      .clk_src        = SPI_CLK_SRC_DEFAULT,
      .spi_bus        = (stripIndex == 8) ? SPI2_HOST : SPI3_HOST,
      .flags.with_dma = true,
    };
    ESP_ERROR_CHECK(led_strip_new_spi_device(&strip_config, &spi_config, &led_strip));
    ESP_LOGI(TAG, "Created LED strip object with SPI backend");
  } else {
    ESP_LOGE(TAG, "Invalid LED strip number");
    return NULL;
  }
  return led_strip;
}

static void send_udp_packet(int sock, struct sockaddr_storage* dest_addr, void* message, int message_len) {
  char tx_buffer[256];
  if (message_len > sizeof(tx_buffer)) {
    ESP_LOGE(TAG, "Message too long to send");
    return;
  }
  memcpy(tx_buffer, message, message_len);
  int err = sendto(sock, tx_buffer, message_len, 0,
                   (struct sockaddr*) dest_addr, sizeof(struct sockaddr_storage));
  if (err < 0) {
    ESP_LOGE(TAG, "Error occurred during sending: errno %d", errno);
  }
}

static inline bool display_strip_is_enabled(uint32_t configStripsEnabled, int stripIndex) {
  return configStripsEnabled & (1 << stripIndex);
}

static inline uint32_t display_get_buffer_fillstate() {
  int16_t writePos = displayState.writeIndex % RingBufferLength;
  int16_t readPos = displayState.readIndex % RingBufferLength;
  return writePos >= readPos ? writePos - readPos : RingBufferLength + writePos - readPos;
}

static void display_strips_update(void* arg)
{
  xSemaphoreTake(semaphoreDisplay, portMAX_DELAY);

  // check if we can read the next frame
  const bool bCanRead = displayState.readIndex < displayState.writeIndex;
  uint8_t color[4] = {};
  const uint32_t dimW = displayConfig.dimensionsWidth;
  const uint32_t dimH = displayConfig.dimensionsHeight;
  const uint32_t configStripsEnabled = displayConfig.stripsEnable;
  const uint64_t readIdx = displayState.readIndex % RingBufferLength;
  for (uint32_t stripIndex = 0; bCanRead && stripIndex < dimW && stripIndex < CONFIG_MAX_STRIPS; ++stripIndex) {
    led_strip_handle_t ledStrip = led_strips[stripIndex];
    if (ledStrip == NULL || !display_strip_is_enabled(configStripsEnabled, stripIndex)) {
      continue;
    }
    const display_led_strip_config_t *stripConfig = &displayLedStripConfig[stripIndex];
    for (uint32_t ledIndex = 0; ledIndex < dimH && ledIndex < CONFIG_MAX_LEDS; ++ledIndex) {
      const uint32_t ledState = ledsBuffer[readIdx][stripIndex][ledIndex];
      uint8_t maxBrightness = displayConfig.maxBrightness;
      scale_and_clamp_u32(ledState, maxBrightness, color);
      if (stripConfig->dataTypeId == RGB_DATA_TYPE_RGBW) {
        ESP_ERROR_CHECK(led_strip_set_pixel_rgbw(led_strips[stripIndex], ledIndex,
                                                color[0], color[1], color[2],
                                                color[3]));
      } else {
        ESP_ERROR_CHECK(led_strip_set_pixel(led_strips[stripIndex], ledIndex,
                                            color[0], color[1], color[2]));
      }
    }
  }

  if (bCanRead) {
    displayState.readIndex = (displayState.readIndex + 1);
  }

#ifdef CONFIG_USE_ASYNC_RMT
  /* Refresh all strips */
  for (int stripIndex = 0; stripIndex < dimW; stripIndex++) {
    if (led_strips[stripIndex] == NULL || !display_strip_is_enabled(configStripsEnabled, stripIndex)) {
      continue;
    }
    ESP_ERROR_CHECK(led_strip_refresh_begin(led_strips[stripIndex]));
  }

  for (int stripIndex = 0; stripIndex < dimW; stripIndex++) {
    if (led_strips[stripIndex] == NULL || !display_strip_is_enabled(configStripsEnabled, stripIndex)) {
      continue;
    }
    ESP_ERROR_CHECK(led_strip_refresh_end(led_strips[stripIndex]));
  }
#else
  for (int stripIndex = 0; stripIndex < dimW; stripIndex++) {
    if (led_strips[stripIndex] == NULL || !display_strip_is_enabled(configStripsEnabled, stripIndex)) {
      continue;
    }
    ESP_ERROR_CHECK(led_strip_refresh(led_strips[stripIndex]));
  }
#endif

  /* send heartbeat */
  if (displayState.bHeartbeatEnabled && displayConfig.heartbeatIntervalFrames > 0 
      && displayState.numCallbacks % displayConfig.heartbeatIntervalFrames == 0) {
    struct packet_heartbeat_t heartbeat = {
      .header = {
          .packetType = PKT_TYPE_HEARTBEAT,
          .len        = sizeof(struct heartbeat_message_t),
      },
      .message = {
          .frameId = displayState.numCallbacks,
          .bufferFillLevel = display_get_buffer_fillstate(),
      },
    };
    int socket = s_socket;
    if (socket != -1) {
      if (xSemaphoreTake(semaphoreNetworkMasterAddress, portMAX_DELAY) == pdTRUE) {
        if (g_udp_master_address.s2_len) {
            send_udp_packet(socket, &g_udp_master_address, &heartbeat, sizeof(heartbeat));
            int heartbeatsPerSecond = displayConfig.frameRate / displayConfig.heartbeatIntervalFrames;
            if (displayState.bRuntimeStatsEnabled && displayState.numCallbacks % heartbeatsPerSecond == 0) {
              struct packet_runtime_stats_t stats = {
                .header = {
                  .packetType = PKT_TYPE_RUNTIME_STATS,
                  .len = sizeof(struct runtime_stats_t),
                },
                .message = {
                  .readIndex = displayState.readIndex,
                  .writeIndex = displayState.writeIndex,
                  .numCallbacks = displayState.numCallbacks,
                  .numFrames = displayState.numFrames,
                  .numBufferUnderrun = displayState.numBufferUnderrun,
                  .numHeartbeats = displayState.numHeartbeats,
                  .fps_actual = displayState.fps_actual,
                  .fps_callbacks = displayState.fps_callbacks,
                },
              };
              send_udp_packet(socket, &g_udp_master_address, &stats, sizeof(stats));
            }
            displayState.numHeartbeats++;
        }
        xSemaphoreGive(semaphoreNetworkMasterAddress);
      }
    }
  }

