nidefawl/esp32-rgb/main/esp32-rgb-main.c
  if (bCanRead) {
    displayState.numFrames++;
    g_timeLastFrame_us = esp_timer_get_time();
  } else {
    if (displayState.numFrames > 0) {
      displayState.numBufferUnderrun++;
      // if we haven't received a frame in 5 seconds, reset the master address so broadcasts are sent again
      if (esp_timer_get_time() - g_timeLastFrame_us > 5e6) {
        if (xSemaphoreTake(semaphoreNetworkMasterAddress, portMAX_DELAY) == pdTRUE) {
          g_timeLastFrame_us = esp_timer_get_time();
          bool bHadMaster = g_udp_master_address.s2_len > 0;
          memset(&g_udp_master_address, 0, sizeof(g_udp_master_address));
          xSemaphoreGive(semaphoreNetworkMasterAddress);
          if (bHadMaster) {
            ESP_LOGI(TAG, "Resetting master address");
          }
        }
      }
    }
  }
  displayState.numCallbacks++;
  xSemaphoreGive(semaphoreDisplay);
}

static void display_strips_init() {
  ESP_LOGI(TAG, "Initializing Dimensions: %lux%lu", displayConfig.dimensionsWidth, displayConfig.dimensionsHeight);
  for (int i = 0; i < CONFIG_MAX_STRIPS; i++) {
    if (led_strips[i] != NULL) {
      ESP_ERROR_CHECK(led_strip_del(led_strips[i]));
      led_strips[i] = NULL;
    }
  }

  for (int i = 0; i < displayConfig.dimensionsWidth && i < CONFIG_MAX_STRIPS; i++) {
    display_led_strip_config_t* stripConfig = &displayLedStripConfig[i];
    if (stripConfig->gpio < 0) {
      continue;
    }
    led_strips[i] = display_led_strip_configure(i, stripConfig);
    if (led_strips[i] == NULL) {
      ESP_LOGE(TAG, "Failed to configure LED strip %d", i);
      return;
    }
  }
  for (int i = 0; i < displayConfig.dimensionsWidth && i < CONFIG_MAX_STRIPS; i++) {
    if (led_strips[i] != NULL) {
      ESP_ERROR_CHECK(led_strip_clear(led_strips[i]));
    }
  }
}

static void led_display_task() {
  const esp_timer_create_args_t periodic_timer_args = {
    .callback = &display_strips_update,
    .arg = NULL,
    /* name is optional, but may help identify the timer when debugging */
    .name = "periodic",
    // use ISR dispatch method to call the timer callback
    .dispatch_method = ESP_TIMER_TASK,
    .skip_unhandled_events = true,
  };
  ESP_ERROR_CHECK(esp_timer_create(&periodic_timer_args, &periodic_timer));
  display_strips_init();
  ESP_ERROR_CHECK(esp_timer_start_periodic(periodic_timer, 1000000 / displayConfig.frameRate));
  int64_t timeLastFPS_us = esp_timer_get_time();
  while (1) {
    vTaskDelay(pdMS_TO_TICKS(1000));
    int64_t numFrames = displayState.numFrames - displayState.numLastFrames;
    int64_t numCallbacks = displayState.numCallbacks - displayState.numLastCallbacks;
    int64_t timeSince_us = esp_timer_get_time() - timeLastFPS_us;

    // print FPS stats every 5 seconds
    if (timeSince_us > 5 * 1e6) {
      displayState.fps_actual = numFrames / (((float) timeSince_us) / 1e6);
      displayState.fps_callbacks = numCallbacks / (((float) timeSince_us) / 1e6);
      uint32_t readWriteDiff = display_get_buffer_fillstate();
      ESP_LOGI(TAG, "Frames %lld - Dropped %lld - FPS: %.2f - CALLBACK: %.2f - Buffer: %lu (rd %llu/wr %llu) - Heartbeats: %lld",
                displayState.numFrames, displayState.numBufferUnderrun,
                displayState.fps_actual, displayState.fps_callbacks, readWriteDiff, displayState.readIndex, displayState.writeIndex, displayState.numHeartbeats);
      timeLastFPS_us = esp_timer_get_time();
      displayState.numLastFrames = displayState.numFrames;
      displayState.numLastCallbacks = displayState.numCallbacks;
    }

    // Write config updates to nvs
    if (bDisplayConfigChanged) {
      xSemaphoreTake(semaphoreDisplay, portMAX_DELAY);
      bDisplayConfigChanged = false;
      write_nvs_struct("display_config", &displayConfig, sizeof(display_config_t));
      ESP_LOGI(TAG, "wrote display config to flash");
      xSemaphoreGive(semaphoreDisplay);
    }

    // Broadcast packet handling
    int socket = s_socket;
    if (socket != -1) {
      if (xSemaphoreTake(semaphoreNetworkMasterAddress, portMAX_DELAY) == pdTRUE) {
        if (!g_udp_master_address.s2_len) {
          struct packet_broadcast_t pkt = {
            .header = {
              .packetType = PKT_TYPE_ANNOUNCE_BROADCAST,
              .len        = sizeof(int),
            },
            .message = 0,
          };
          struct sockaddr_storage udp_broadcast_address = {};
          struct sockaddr_in* udp_broadcast_address_in = (struct sockaddr_in*)&udp_broadcast_address;
          udp_broadcast_address_in->sin_family = AF_INET;
          udp_broadcast_address_in->sin_addr.s_addr = INADDR_BROADCAST;
          udp_broadcast_address_in->sin_port = htons(LED_UDP_LISTEN_PORT);
          send_udp_packet(socket, &udp_broadcast_address, &pkt, sizeof(pkt));
        }
        xSemaphoreGive(semaphoreNetworkMasterAddress);
      }
    }
  }
}

void handle_config_single_packet(struct packet_config_single_t* pkt) {
  if (pkt->message.cfgId >= CFG_NUM_CONFIGS) {
    ESP_LOGI(TAG, "Invalid config ID %lu", pkt->message.cfgId);
    return;
  }
  enum RGBConfigType cfgId = pkt->message.cfgId;
  xSemaphoreTake(semaphoreDisplay, portMAX_DELAY);
  display_config_t config = displayConfig;
  xSemaphoreGive(semaphoreDisplay);
  switch (cfgId) {
    case CFG_ID_DIMENSIONS_WIDTH:
      config.dimensionsWidth = clamp_u32(pkt->message.value, 1, CONFIG_MAX_STRIPS);
      break;
    case CFG_ID_DIMENSIONS_HEIGHT:
      config.dimensionsHeight = clamp_u32(pkt->message.value, 1, CONFIG_MAX_LEDS);
      break;
    case CFG_ID_MAX_BRIGHTNESS:
      config.maxBrightness = clamp_u32(pkt->message.value, 0, 255);
      break;
    case CFG_ID_FRAME_RATE:
      config.frameRate = clamp_u32(pkt->message.value, 1, 10000);
      break;
    case CFG_ID_STRIPS_ENABLE:
      config.stripsEnable = pkt->message.value;
      break;
    case CFG_ID_ENABLE_DEBUG:
      config.debugFlags = pkt->message.value;
      break;
    case CFG_ID_HEARTBEAT_INTERVAL_FRAMES:
      config.heartbeatIntervalFrames = pkt->message.value;
      break;
    default:
      break;
  }
  if (display_config_validate(&config)) {
    display_config_set(&config, false);
  }
}

void handle_config_all_packet(display_config_t* config) {
  if (display_config_validate(config)) {
    display_config_set(config, true);
    ESP_LOGI(TAG, "Set config all");
  } else {
    ESP_LOGE(TAG, "Invalid config all");
  }
}

struct packet_strip_config_all_t read_strip_config() {
  struct packet_strip_config_all_t readStripConfig = {
    .header = {
        .packetType = PKT_TYPE_READ_STRIP_CONFIG_ALL,
        .len        = sizeof(display_led_strip_config_all_t),
    },
    .message = {},
  };
  for (int i = 0; i < CONFIG_MAX_STRIPS; i++) {
    readStripConfig.message.configs[i] = displayLedStripConfig[i];
  }
  return readStripConfig;
}

void write_display_config(display_network_config_t* config) {
  if (display_network_config_validate(config)) {
    displayNetworkConfig = *config;
    write_nvs_struct("network_config", config, sizeof(display_network_config_t));
    ESP_LOGI(TAG, "Set network config");
  } else {
    ESP_LOGE(TAG, "Invalid network config");
  }
}
struct packet_network_config_t read_network_config() {
  struct packet_network_config_t config = {
    .header = {
      .packetType = PKT_TYPE_READ_NETWORK_CONFIG,
      .len        = sizeof(display_network_config_t),
    },
    .message = displayNetworkConfig,
  };
  return config;
};

struct packet_heartbeat_t handle_heartbeat() {
  struct packet_heartbeat_t heartbeat = {
    .header = {
      .packetType = PKT_TYPE_HEARTBEAT,
      .len        = sizeof(struct heartbeat_message_t),
    },
    .message = {
      .frameId = displayState.numCallbacks,
        .bufferFillLevel = display_get_buffer_fillstate(),
    },
  };
  return heartbeat;
}

void handle_request_heartbeat_packet(struct request_heartbeat_message_t* req, struct sockaddr_storage* source_addr, char addr_str[128]) {
  if (xSemaphoreTake(semaphoreNetworkMasterAddress, portMAX_DELAY) == pdTRUE) {
    displayState.bHeartbeatEnabled = req->flags & REQUEST_HEARTBEAT_ENABLE;
    displayState.bRuntimeStatsEnabled = req->flags & REQUEST_RUNTIME_STATS_ENABLE;
    if (!displayState.bHeartbeatEnabled) {
      memset(&g_udp_master_address, 0, sizeof(struct sockaddr_storage));
    } else {
      memcpy(&g_udp_master_address, source_addr, sizeof(struct sockaddr_storage));
    }
    xSemaphoreGive(semaphoreNetworkMasterAddress);
    if (!displayState.bHeartbeatEnabled) {
      ESP_LOGI(TAG, "Disabled heartbeat and stats");
    } else {
      ESP_LOGI(TAG, "Enabled heartbeat. Destination host: %s", addr_str);
    }
  }
}

struct packet_config_all_t read_display_config() {
  xSemaphoreTake(semaphoreDisplay, portMAX_DELAY);
  struct packet_config_all_t config = {
    .header = {
        .packetType = PKT_TYPE_CONFIG_ALL,
        .len        = sizeof(display_config_t),
    },
    .message = displayConfig,
  };
  xSemaphoreGive(semaphoreDisplay);
  return config;
}

