nidefawl/esp32-rgb/main/esp32-rgb-main.c
void display_handle_packet(uint8_t* rx_buffer, int len, int sock,
                   struct sockaddr_storage* source_addr, char addr_str[128]) {
  struct packet_hdr_t* hdr = (struct packet_hdr_t*) rx_buffer;
  if (hdr->packetType == PKT_TYPE_HEARTBEAT) {
    struct packet_heartbeat_t heartbeat = handle_heartbeat();
    send_udp_packet(sock, source_addr, &heartbeat, sizeof(heartbeat));
  } else if (hdr->packetType == PKT_TYPE_REQUEST_HEARTBEAT) {
    struct packet_request_heartbeat_t* pkt = (struct packet_request_heartbeat_t*) rx_buffer;
    handle_request_heartbeat_packet(&pkt->message, source_addr, addr_str);
  } else if (hdr->packetType == PKT_TYPE_READ_NETWORK_CONFIG) {
    struct packet_network_config_t readConfig = read_network_config();
    send_udp_packet(sock, source_addr, &readConfig, sizeof(readConfig));
  } else if (hdr->packetType == PKT_TYPE_WRITE_NETWORK_CONFIG) {
    struct packet_network_config_t* pkt = (struct packet_network_config_t*) rx_buffer;
    write_display_config(&pkt->message);
  } else if (hdr->packetType == PKT_TYPE_READ_CONFIG) {
    struct packet_config_all_t readConfig = read_display_config();
    send_udp_packet(sock, source_addr, &readConfig, sizeof(readConfig));
  } else if (hdr->packetType == PKT_TYPE_READ_STRIP_CONFIG_ALL) {
    struct packet_strip_config_all_t readStripConfig = read_strip_config();
    send_udp_packet(sock, source_addr, &readStripConfig, sizeof(readStripConfig));
  } else if (hdr->packetType == PKT_TYPE_WRITE_STRIP_CONFIG_ALL) {
    struct packet_strip_config_all_t* pkt = (struct packet_strip_config_all_t*) rx_buffer;
    write_strip_config(&pkt->message);
  } else if (hdr->packetType == PKT_TYPE_CONFIG_ALL) {
    struct packet_config_all_t* pkt = (struct packet_config_all_t*) rx_buffer;
    handle_config_all_packet(&pkt->message);
  } else if (hdr->packetType == PKT_TYPE_CONFIG_SINGLE) {
    struct packet_config_single_t* pkt = (struct packet_config_single_t*) rx_buffer;
    handle_config_single_packet(pkt);
  } else if (hdr->packetType == PKT_TYPE_LED_FRAME) {
      struct packet_led_frame_t* pkt = (struct packet_led_frame_t*) rx_buffer;
      if (pkt->message.frameOffset + pkt->message.frameSize >
          displayConfig.dimensionsWidth * displayConfig.dimensionsHeight) {
        ESP_LOGE(TAG, "Invalid frame offset %lu and size %lu",
                pkt->message.frameOffset, pkt->message.frameSize);
        return;
      }
      // check received data length
      int expectedSize = sizeof(struct packet_hdr_t) +
                        sizeof(struct led_frame_message_t) +
                        pkt->message.frameSize * 4;
      if (len != expectedSize) {
        ESP_LOGE(TAG, "Invalid frame data length %d. Expected %d", len, expectedSize);
        return;
      }
      uint32_t* pData = (uint32_t*) pkt->message.data;
      uint64_t writeIdx = displayState.writeIndex % RingBufferLength;
      for (uint32_t frameIdx = 0; frameIdx < pkt->message.frameSize; frameIdx++) {
        const uint32_t ledIndex      = pkt->message.frameOffset + frameIdx;
        const uint32_t stripIndex    = ledIndex / displayConfig.dimensionsHeight;
        const uint32_t ledStripIndex = ledIndex % displayConfig.dimensionsHeight;
        ledsBuffer[writeIdx][stripIndex][ledStripIndex] = pData[frameIdx];
      }
      displayState.writeIndex = (displayState.writeIndex + 1);
  }
}
void send_websocket_packet(httpd_req_t *req, httpd_ws_frame_t* ws_pkt, void* message, int len) {
  ws_pkt->payload = message;
  ws_pkt->len = len;
  ws_pkt->type = HTTPD_WS_TYPE_BINARY;
  int ret = httpd_ws_send_frame(req, ws_pkt);
  if (ret != ESP_OK) {
      ESP_LOGE(TAG, "httpd_ws_send_frame failed with %d", ret);
  }
}
bool display_handle_websocket_packet(httpd_req_t *req, httpd_ws_frame_t* ws_pkt) {
  struct packet_hdr_t* hdr = (struct packet_hdr_t*) ws_pkt->payload;
  if (hdr->packetType == PKT_TYPE_READ_NETWORK_CONFIG) {
    struct packet_network_config_t readConfig = read_network_config();
    send_websocket_packet(req, ws_pkt, &readConfig, sizeof(readConfig));
    return true;
  } else if (hdr->packetType == PKT_TYPE_WRITE_NETWORK_CONFIG) {
    struct packet_network_config_t* pkt = (struct packet_network_config_t*) ws_pkt->payload;
    write_display_config(&pkt->message);
    return false;
  } else if (hdr->packetType == PKT_TYPE_READ_CONFIG) {
    struct packet_config_all_t readConfig = read_display_config();
    send_websocket_packet(req, ws_pkt, &readConfig, sizeof(readConfig));
    return true;
  } else if (hdr->packetType == PKT_TYPE_READ_STRIP_CONFIG_ALL) {
    struct packet_strip_config_all_t readStripConfig = read_strip_config();
    send_websocket_packet(req, ws_pkt, &readStripConfig, sizeof(readStripConfig));
    return true;
  } else if (hdr->packetType == PKT_TYPE_WRITE_STRIP_CONFIG_ALL) {
    struct packet_strip_config_all_t* pkt = (struct packet_strip_config_all_t*) ws_pkt->payload;
    write_strip_config(&pkt->message);
    return false;
  } else if (hdr->packetType == PKT_TYPE_CONFIG_ALL) {
    struct packet_config_all_t* pkt = (struct packet_config_all_t*) ws_pkt->payload;
    handle_config_all_packet(&pkt->message);
    return false;
  } else if (hdr->packetType == PKT_TYPE_CONFIG_SINGLE) {
    struct packet_config_single_t* pkt = (struct packet_config_single_t*) ws_pkt->payload;
    handle_config_single_packet(pkt);
    return false;
  }
  return false;
}

static void udp_server_task(void* pvParameters) {
  char addr_str[128];
#if CONFIG_USE_IPV6
  int addr_family = AF_INET6;
#else
  int addr_family = AF_INET;
#endif
  int ip_protocol = 0;
  struct sockaddr_in6 dest_addr;
  while (1) {
    xSemaphoreTake(semaphoreSocketStart, portMAX_DELAY);
    bzero(&dest_addr, sizeof(dest_addr));
    if (addr_family == AF_INET) {
      struct sockaddr_in* dest_addr_ip4 = (struct sockaddr_in*) &dest_addr;
      dest_addr_ip4->sin_addr.s_addr    = htonl(INADDR_ANY);
      dest_addr_ip4->sin_family         = AF_INET;
      dest_addr_ip4->sin_port           = htons(LED_UDP_LISTEN_PORT);
      ip_protocol                       = IPPROTO_IP;
    } else if (addr_family == AF_INET6) {
      dest_addr.sin6_family = AF_INET6;
      dest_addr.sin6_port   = htons(LED_UDP_LISTEN_PORT);
      ip_protocol           = IPPROTO_IPV6;
    }
    if (s_socket != -1) {
      ESP_LOGE(TAG, "Shutting down socket and restarting...");
      shutdown(s_socket, 0);
      close(s_socket);
      s_socket = -1;
    }

