nidefawl/esp32-rgb/main/esp32-rgb-main.c
    int newSocket = socket(addr_family, SOCK_DGRAM, ip_protocol);
    if (newSocket < 0) {
      ESP_LOGE(TAG, "Unable to create socket: errno %d", errno);
      break;
    }

#if defined(CONFIG_USE_IPV4) && defined(CONFIG_USE_IPV6)
    if (addr_family == AF_INET6) {
      // Note that by default IPV6 binds to both protocols, it is must be
      // disabled if both protocols used at the same time (used in CI)
      int opt = 1;
      setsockopt(newSocket, SOL_SOCKET, SO_REUSEADDR, &opt, sizeof(opt));
    }
#endif

    // Set infinite timeout
    struct timeval timeout;
    bzero(&timeout, sizeof(timeout));
    timeout.tv_sec  = 0;
    timeout.tv_usec = 0;
    setsockopt(newSocket, SOL_SOCKET, SO_RCVTIMEO, &timeout, sizeof timeout);

    int err = bind(newSocket, (struct sockaddr*) &dest_addr, sizeof(dest_addr));
    if (err < 0) {
      ESP_LOGE(TAG, "Socket unable to bind: errno %d", errno);
    }
    int broadcastValue = 1;
    err = setsockopt(newSocket, SOL_SOCKET, SO_BROADCAST, &broadcastValue, sizeof(broadcastValue));
    if (err < 0) {
      ESP_LOGE(TAG, "Socket unable to set broadcast: errno %d", errno);
    }
    s_socket = newSocket;

    struct sockaddr_storage source_addr;// Large enough for both IPv4 or IPv6
    socklen_t socklen = sizeof(source_addr);

    while (s_socket >= 0) {
      bzero(&source_addr, sizeof(source_addr));
      ssize_t len = recvfrom(s_socket, udp_rx_buffer, sizeof(udp_rx_buffer), 0,
                         (struct sockaddr*) &source_addr, &socklen);
      if (len < 0) {
        ESP_LOGE(TAG, "recvfrom failed: errno %d", errno);
        break;
      }

      // Get the sender's ip address as string
      if (source_addr.ss_family == PF_INET) {
        inet_ntoa_r(((struct sockaddr_in*) &source_addr)->sin_addr, addr_str,
                    sizeof(addr_str) - 1);
      } else if (source_addr.ss_family == PF_INET6) {
        inet6_ntoa_r(((struct sockaddr_in6*) &source_addr)->sin6_addr, addr_str,
                     sizeof(addr_str) - 1);
      }

      display_handle_packet(udp_rx_buffer, len, s_socket, &source_addr, addr_str);
    }
  }
}

static void initialise_mdns(void)
{
    mdns_init();
    mdns_hostname_set(displayNetworkConfig.hostname);
    mdns_instance_name_set("ESP32 RGB LED Controller");

    mdns_txt_item_t serviceTxtData[] = {
        {"board", "esp32"},
        {"path", "/"}};

    ESP_ERROR_CHECK(mdns_service_add(TAG, "_http", "_tcp", 80, serviceTxtData,
                                     sizeof(serviceTxtData) / sizeof(serviceTxtData[0])));
}
esp_err_t webinterface_register_uri_handler(httpd_handle_t server);

static void connect_handler(void *arg, esp_event_base_t event_base,
                            int32_t event_id, void *event_data)
{
    if (semaphoreNetwork) {
      xSemaphoreGive(semaphoreNetwork);
    }
}
static void connect_handler_ipv6(void *arg, esp_event_base_t event_base,
                        int32_t event_id, void *event_data)
{
    if (semaphoreNetwork) {
      xSemaphoreGive(semaphoreNetwork);
    }
}
static void disconnect_handler_wifi(void *arg, esp_event_base_t event_base,
                        int32_t event_id, void *event_data)
{
  if (s_socket != -1) {
    shutdown(s_socket, 0);
    close(s_socket);
    s_socket = -1;
    // clear g_udp_master_address
    if (xSemaphoreTake(semaphoreNetworkMasterAddress, portMAX_DELAY) == pdTRUE) {
      memset(&g_udp_master_address, 0, sizeof(g_udp_master_address));
      xSemaphoreGive(semaphoreNetworkMasterAddress);
    }
  }
}

void app_main(void) {
  display_config_reset(&displayConfig);
  esp_err_t err = nvs_flash_init();
  ESP_ERROR_CHECK( err );
  ESP_ERROR_CHECK(esp_netif_init());
  ESP_ERROR_CHECK(esp_event_loop_create_default());
  semaphoreDisplay = xSemaphoreCreateBinaryStatic(&s_semaphoreDisplay);
  semaphoreNetwork = xSemaphoreCreateCounting(2, 0);
  semaphoreSocketStart = xSemaphoreCreateBinary();
  semaphoreNetworkMasterAddress = xSemaphoreCreateBinary();
  if (semaphoreNetwork == NULL 
      || semaphoreDisplay == NULL 
      || semaphoreSocketStart == NULL
      || semaphoreNetworkMasterAddress == NULL
  ) {
    ESP_LOGE(TAG, "Failed to create semaphore");
    return;
  }
  xSemaphoreGive(semaphoreDisplay);
  xSemaphoreGive(semaphoreNetworkMasterAddress);
  display_load_config_from_flash();
  display_state_reset();
  xTaskCreatePinnedToCore(led_display_task, "led_display", 4096, NULL, 6, NULL, 1);
  ESP_ERROR_CHECK(esp_event_handler_register(IP_EVENT, IP_EVENT_STA_GOT_IP, &connect_handler, NULL));
  ESP_ERROR_CHECK(esp_event_handler_register(IP_EVENT, IP_EVENT_GOT_IP6, &connect_handler_ipv6, NULL));
  ESP_ERROR_CHECK(esp_event_handler_register(WIFI_EVENT, WIFI_EVENT_STA_DISCONNECTED, &disconnect_handler_wifi, NULL));
  
  initialise_mdns();
  netbiosns_init();
  netbiosns_set_name(displayNetworkConfig.hostname);
  struct network_init_cfg_t cfg = {
    .wifiMode = displayNetworkConfig.wifiMode == NETWORK_WIFI_MODE_AP ? WIFI_MODE_AP : WIFI_MODE_STA,
  };
  strncpy(cfg.apWifiSsid, displayNetworkConfig.apWifiSsid, sizeof(cfg.apWifiSsid));
  strncpy(cfg.apWifiPassword, displayNetworkConfig.apWifiPassword, sizeof(cfg.apWifiPassword));
  strncpy(cfg.staWifiSsid, displayNetworkConfig.staWifiSsid, sizeof(cfg.staWifiSsid));
  strncpy(cfg.staWifiPassword, displayNetworkConfig.staWifiPassword, sizeof(cfg.staWifiPassword));
  nvs_wifi_connect(&cfg);
  nvs_wifi_connect_start_http_server(NVS_WIFI_CONNECT_MODE_RESTART_ESP32, webinterface_register_uri_handler);
  xTaskCreate(udp_server_task, "udp_server", 4096*2, (void*) 0, 5, NULL);
  while (1) {
    xSemaphoreTake(semaphoreNetwork, portMAX_DELAY);
    // wait for a second notification (IP6), but only for 5 seconds
    xSemaphoreTake(semaphoreNetwork, pdMS_TO_TICKS(5000));
    // log network restart
    ESP_LOGI(TAG, "Network restart...");
    if (s_socket != -1) {
      shutdown(s_socket, 0);
      close(s_socket);
      s_socket = -1;
    }
    if (xSemaphoreTake(semaphoreDisplay, portMAX_DELAY)) {
      display_buffer_position_reset();
      xSemaphoreGive(semaphoreDisplay);
    }
    xSemaphoreGive(semaphoreSocketStart);
    ESP_LOGI(TAG, "Network restarted");
  }
}
